# シナリオテーブル
ScenarioTbl = {
  'opening' => [
    ['bg00.gif', "嵐で知らないところに流されちゃった…\nどっちへ行けばいいのかなぁ…。",],
    ['fault-a',  "右に行ってみる"],
    ['fault-b',  "左に行ってみる"],
    ['depth',    "もっと深く潜ってみる"],
  ],
  'fault-a' => [
    ['bg01.gif', "水が冷たくなってきた。こっちじゃないみたい…。"],
    ['opening',  "戻る"],
  ],
  'fault-b' => [
    ['bg02.gif', "うわっ。鰯の大群だ！！"],
    ['opening',  "戻る"],
  ],
  'depth' => [
    ['bg03.gif', "あ、何かいる。どうしよう…。"],
    ['depth2',   "近づいてみる"],
    ['opening',  "怖いから戻る"],
  ],
  'depth2' => [
    ['bg04.gif', "ジンベエザメさんだ。\n身体は大きいけどとっても優しいんだって言ってたな。"],
    ['opening',  "戻る"],
    ['talk',     "話しかける"],
    ['chase',    "こっそりついていく"],
  ],
  'talk' => [
    ['bg04.gif', "ボク、迷子になっちゃって…\nえっ、送ってくれるの？！"],
    ['goal',     "ありがとう！！"],
  ],
  'chase' => [
    ['bg06.gif', "大変！もっと遠くまできちゃったよ～"],
    ['opening',  "戻る"],
  ],
  'goal' => [
    ['bg05.gif', "やったー。戻れた！！ジンベエザメさんありがとう！！"],
    [nil,        "オワリ"],
  ],
}
